app/controllers/chap_five_controller.rb

  def map5
    structures=FccStructure.find_all_by_state 'HI', :include=>[:fcc_owner,:fcc_location]
---
SELECT * FROM `fcc_structures` WHERE (`fcc_structures`.`state` = 'HI')

  def length
    structures=FccStructure.find_all_by_state 'HI', :include=>[:fcc_owner,:fcc_location]
    @towers=Array.new
    structures.each do |s|
---
SELECT * FROM `fcc_structures` WHERE (`fcc_structures`.`state` = 'HI') LIMIT 1
SELECT * FROM `fcc_structures` ORDER BY fcc_structures.unique_si DESC LIMIT 1