app/controllers/chap_three_controller.rb

  def create
    marker = Marker.new(params[:m])
    if marker.save
---
INSERT INTO `markers` (`lat`, `lng`, `found`, `left`) VALUES('37.452239824728395', '-122.18273162841797', '', '')

  def list
    all_markers = Marker.find :all
---
SELECT * FROM `markers`