app/controllers/chap_six_controller.rb

  def map6
    @towers = Tower.find :all,
      :conditions=>['state = ? AND latitude < ? AND longitude > ?  AND latitude > ? AND longitude < ?',
        'HI', 20.40, -156.34, 18.52, -154.67]

    @types = @towers.collect{|tower|tower.structure_type}.uniq
---
SELECT * FROM `towers` WHERE (state = 'HI' AND latitude < 20.4 AND longitude > -156.34 AND latitude > 18.52 AND longitude < -154.67)
SELECT * FROM `fcc_structures` LIMIT 1

  def list
    @towers = Tower.find :all,
      :conditions=>['state = ? AND latitude < ? AND longitude > ?  AND latitude > ? AND longitude < ?',
        'HI', 20.40, -156.34, 18.52, -154.67]
---
SELECT * FROM `towers` WHERE (state = 'HI' AND latitude < 20.4 AND longitude > -156.34 AND latitude > 18.52 AND longitude < -154.67)